[{"type":"component","name":"nol-view","properties":[{"name":"[center]","type":"Coordinate","description":"<p>The initial center for the view. If a user projection is not set, the coordinate system for the center is specified with the <code>projection</code> option. Layer sources will not be fetched if this is not set, but the center can be set later.</p>\n"},{"name":"[constrainRotation]","type":"boolean | number","default":true,"description":"<p>Rotation constraint. <code>false</code> means no constraint. <code>true</code> means no constraint, but snap to zero near zero. A number constrains the rotation to that number of values. For example, <code>4</code> will constrain the rotation to 0, 90, 180, and 270 degrees.</p>\n"},{"name":"[enableRotation]","type":"boolean","default":true,"description":"<p>Enable rotation. If <code>false</code>, a rotation constraint that always sets the rotation to zero is used. The <code>constrainRotation</code> option has no effect if <code>enableRotation</code> is <code>false</code>.</p>\n"},{"name":"[extent]","type":"Extent","description":"<p>The extent that constrains the view, in other words, nothing outside of this extent can be visible on the map.</p>\n"},{"name":"[constrainOnlyCenter]","type":"boolean","description":"<p>If true, the extent constraint will only apply to the view center and not the whole extent.</p>\n"},{"name":"[smoothExtentConstraint]","type":"boolean","default":true,"description":"<p>If true, the extent constraint will be applied smoothly, i.e. allow the view to go slightly outside of the given <code>extent</code>.</p>\n"},{"name":"[maxResolution]","type":"number","description":"<p>The maximum resolution used to determine the resolution constraint. It is used together with <code>minResolution</code> (or <code>maxZoom</code>) and <code>zoomFactor</code>. If unspecified it is calculated in such a way that the projection&#39;s validity extent fits in a <code>256x256</code> px tile. If the projection is Spherical <code>Mercator</code> (the default) then <code>maxResolution</code> defaults to <code>40075016.68557849 / 256 = 156543.03392804097</code>.</p>\n"},{"name":"[minResolution]","type":"number","description":"<p>The minimum resolution used to determine the resolution constraint. It is used together with <code>maxResolution</code> (or <code>minZoom</code>) and <code>zoomFactor</code>. If unspecified it is calculated assuming 29 zoom levels (with a factor of 2). If the projection is Spherical <code>Mercator</code> (the default) then <code>minResolution</code> defaults to <code>40075016.68557849 / 256 / Math.pow(2, 28) = 0.0005831682455839253</code>.</p>\n"},{"name":"[maxZoom]","type":"number","default":28,"description":"<p>The maximum zoom level used to determine the resolution constraint. It is used together with <code>minZoom</code> (or <code>maxResolution</code>) and <code>zoomFactor</code>. Note that if <code>minResolution</code> is also provided, it is given precedence over <code>maxZoom</code>.</p>\n"},{"name":"[minZoom]","type":"number","description":"<p>The minimum zoom level used to determine the resolution constraint. It is used together with <code>maxZoom</code> (or <code>minResolution</code>) and <code>zoomFactor</code>. Note that if <code>maxResolution</code> is also provided, it is given precedence over <code>minZoom</code>.</p>\n"},{"name":"[multiWorld]","type":"boolean","description":"<p>If <code>false</code> the view is constrained so only one world is visible, and you cannot pan off the edge. If <code>true</code> the map may show multiple worlds at low zoom levels. Only used if the <code>projection</code> is global. Note that if <code>extent</code> is also provided it is given precedence.</p>\n"},{"name":"[constrainResolution]","type":"boolean","description":"<p>If true, the view will always animate to the closest zoom level after an interaction; false means intermediary zoom levels are allowed.</p>\n"},{"name":"[smoothResolutionConstraint]","type":"boolean","default":true,"description":"<p>If true, the resolution min/max values will be applied smoothly, i. e. allow the view to exceed slightly the given resolution or zoom bounds.</p>\n"},{"name":"[showFullExtent]","type":"boolean","description":"<p>Allow the view to be zoomed out to show the full configured extent. By default, when a view is configured with an extent, users will not be able to zoom out so the viewport exceeds the extent in either dimension. This means the full extent may not be visible if the viewport is taller or wider than the aspect ratio of the configured extent. If showFullExtent is true, the user will be able to zoom out so that the viewport exceeds the height or width of the configured extent, but not both, allowing the full extent to be shown.</p>\n"},{"name":"[projection]","type":"ProjectionLike","default":"EPSG:3857","description":"<p>The projection. The default is Spherical Mercator.</p>\n"},{"name":"[resolution]","type":"number","description":"<p>The initial resolution for the view. The units are <code>projection</code> units per pixel (e.g. meters per pixel). An alternative to setting this is to set <code>zoom</code>. Layer sources will not be fetched if neither this nor <code>zoom</code> are defined, but they can be set later with update <code>zoom</code> or <code>resolution</code> properties.</p>\n"},{"name":"[resolutions]","type":"Array.<number>","description":"<p>Resolutions that determine the zoom levels if specified. The index in the array corresponds to the zoom level, therefore the resolution values have to be in descending order. It also constrains the resolution by the minimum and maximum value. If set the <code>maxResolution</code>, <code>minResolution</code>, <code>minZoom</code>, <code>maxZoom</code>, and <code>zoomFactor</code> options are ignored.</p>\n"},{"name":"[rotation]","type":"number","description":"<p>The initial rotation for the view in radians (positive rotation clockwise, 0 means North).</p>\n"},{"name":"[zoom]","type":"number","description":"<p>Only used if <code>resolution</code> is not defined. Zoom level used to calculate the initial resolution for the view.</p>\n"},{"name":"[zoomFactor]","type":"number","default":2,"description":"<p>The zoom factor used to compute the corresponding resolution.</p>\n"},{"name":"[padding]","type":"Array.<number>","default":"[0, 0, 0, 0]","description":"<p>Padding (in css pixels). If the map viewport is partially covered with other content (overlays) along its edges, this setting allows to shift the center of the viewport away from that content. The order of the values is top, right, bottom, left.</p>\n"},{"name":"[enableChangesAnimation]","type":"boolean","description":"<p>If true, the view&#39;s <code>center</code>, <code>zoom</code> (or <code>resolution</code>), and <code>rotation</code> can be animated for smooth transitions between view states.</p>\n"},{"name":"(onChange)","type":"EventEmitter<BaseEvent>","description":"<p>Generic change event. Triggered when the revision counter is increased.</p>\n"},{"name":"(onCenterChange)","type":"EventEmitter<ObjectEvent>","description":"<p>Triggered when the <code>center</code> of the view state is changed.</p>\n"},{"name":"(onResolutionChange)","type":"EventEmitter<ObjectEvent>","description":"<p>Triggered when the <code>resolution</code> of the view state is changed.</p>\n"},{"name":"(onRotationChange)","type":"EventEmitter<ObjectEvent>","description":"<p>Triggered when the <code>rotation</code> of the view state is changed.</p>\n"},{"name":"(onError)","type":"EventEmitter<BaseEvent>","description":"<p>Generic error event. Triggered when an error occurs.</p>\n"},{"name":"(onPropertyChange)","type":"EventEmitter<ObjectEvent>","description":"<p>Triggered when a property is changed.</p>\n"}],"description":""}]